dev_books_app_api/app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY created_at DESC

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("name", "author", "published", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["author", ""], ["published", ""], ["img", ""], ["created_at", "2020-02-07 06:48:44.159054"], ["updated_at", "2020-02-07 06:48:44.159054"]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "name" = $1, "author" = $2, "customerReviews" = $3, "published" = $4, "img" = $5, "updated_at" = $6 WHERE "books"."id" = $7  [["name", ""], ["author", ""], ["customerReviews", 4], ["published", ""], ["img", ""], ["updated_at", "2020-02-08 20:21:59.289838"], ["id", 89]]